# ImportAdtEntityRoll Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ImportAdtEntityRoll Property
ParameterTypeId Class See Also
---
"Roll"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ImportAdtEntityRoll { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ImportAdtEntityRoll As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ImportAdtEntityRoll {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace